News/2024-03-04.md
Borg News 2024-03-04 | international food intolerance | institutional communism | WW3 buildup | AI cartel | asymmetrical drone warfare
======

# Table of Contents

1.  [Borg News 2024-03-04 | international food intolerance | institutional communism | WW3 buildup | AI cartel | asymmetrical drone warfare](#org3a3fbc1)
    1.  [Business](#orgbc45749)
        1.  [How to hire low experience, high potential people (worktopia.substack.com) | HN | commenter> | 4 Bayesian questions](#orgcf3c796)
    2.  [Health](#org334d857)
        1.  [Ecuadorian Poisoned 400+ American Children Using Leaded Applesauce | National Pulse | clown world](#org3db95c9)
        2.  [Gluten Intolerance | probably caused by pesticides | better in Europe due to soft vs hard wheat](#org1638725)
        3.  [No Biological Free Lunches | Tim Ferriss | plan your supplements/drugs](#org10c9f1f)
    3.  [Politics](#org52a51da)
        1.  [University faculty-activists are a perfect example of elite overproduction a la Turchin. | HN>](#org9772863)
        2.  [Institutions try to preserve the problem to which they are the solution (effectiviology.com) | HN](#orge4b314f)
        3.  [CCP Tightens Exit Controls Amid Sharp Increase In Citizens Fleeing China | The Epoch Times](#org4a659df)
    4.  [Sitreps](#org9c4c5f2)
        1.  [Global SITREP for Monday, 05 February 2024 | Pacific theater moves](#orgfb9b47b)
        2.  [Global SITREP for Friday, 16 February 2024 | Jared Vaughn> | Iran assisting Houthis | Egypt Rafah border wall](#org8d58e1f)
        3.  [Global SITREP for Wednesday, 21 February 2024 | Jared Vaughn | Venezuela to join BRICS](#org47fb2e8)
        4.  [Global SITREP for Thursday, 22 February 2024 | Jared Vaughn> | USCG in PH vs China | China will cyber-blitz Taiwan | Houthis nail another cargo ship](#orge143ae3)
        5.  [Global SITREP for Friday, 23 February 2024 | Jared Vaughn> | Netanyahu aims to eliminate Palestine](#org16f72bc)
        6.  [Global SITREP for Monday, 26 February 2024 | Jared Vaughn> | China vs PH electronic warfare = casus belli | West interferes in Putin's election](#org0dc6026)
        7.  [Global SITREP for Tuesday, 27 February 2024 | Jared Vaughn | PH preps for war with China | NATO troops (officially) to Ukraine?](#org9025f81)
        8.  [Global Situation Report for Wednesday, 28 February 2024. | Jared Vaughn> | BRICS common currency | USmil recruitment woes | China vs PH goes military](#org3f8d2f2)
        9.  [Global SITREP for Thursday, 29 February 2024 | Jared Vaughn> | China will hit civilian satellites | NSA hacking CCP](#org2271c3d)
        10. [Global SITREP for Friday, 01 March 2024 | Jared Vaughn | Egypt in Rafah | Israel to invade Lebanon | China, USA weaponize space](#org50e4cc1)
    5.  [Tech](#orga29644a)
        1.  [Why is the mouse cursor slightly tilted and not straight? (ux.stackexchange.com) | HN | right-handed tool](#org08e1877)
        2.  [Org-mode | Textmind competitors | Reorg](#orgacdbb46)
        3.  [Woke Big Tech Cartel seeks government censorship of AI | HN>](#org0647862)
    6.  [War](#org30d443b)
        1.  [Myanmar’s Spring Revolution is Redefining 21st-Century Warfare | Uday | drone insurgency](#org19beb56)
        2.  [Beware Iran’s Military-Industrial Complex: How Tehran is Changing the Nature of Asymmetric Warfare | Adam Rousselle | suicide drones and medium missiles via sanctions evasion](#org5069c70)
        3.  [The Spy War: How the C.I.A. Secretly Helps Ukraine Fight Putin | Dnyuz> | longtime partners](#org47589ca)
        4.  [American Special Forces in Taiwan for Permanent Training | Mar 2, 2024  | Martin Armstrong>](#orgc707bb4)


<a id="org3a3fbc1"></a>

# Borg News 2024-03-04 | international food intolerance | institutional communism | WW3 buildup | AI cartel | asymmetrical drone warfare


<a id="orgbc45749"></a>

## Business


<a id="orgcf3c796"></a>

### [How to hire low experience, high potential people (worktopia.substack.com) | HN](https://news.ycombinator.com/item?id=39288669) | commenter> | 4 Bayesian questions

> smeeth 12 hours ago | unvote | prev | next [–]  
> 
> People's intuitions around hiring aren't Bayesian enough. I think a good process reduces down to something like:  
> 
> -   Are they smart? (understands quickly + communicates effectively)
> -   Are they cool? (won't put poison in the keurig + pleasant to be around)
> -   Are they high energy? (initiative + action bias)
> -   Do they have the experience needed to be successful in the role?
> 
> Those are pretty strong priors for success. If you find someone with all the above, you've got an ~80% chance of a hit. No need to over-complicate.  
> 
> In my experience, adding more boxes tends to index towards box-checkers who grew up wealthy. That's how you miss the hyper-smart/diligent state school kids who happened to spend their summers working instead of doing model UN.  


<a id="org334d857"></a>

## Health


<a id="org3db95c9"></a>

### [Ecuadorian Poisoned 400+ American Children Using Leaded Applesauce | National Pulse | clown world](https://thenationalpulse.com/2024/02/07/ecuadorian-poisoned-400-americans-using-applesauce/)


<a id="org1638725"></a>

### Gluten Intolerance | probably caused by pesticides | better in Europe due to soft vs hard wheat

<https://twitter.com/coookwithchris/status/1762479700562071695>  


<a id="org10c9f1f"></a>

### No Biological Free Lunches | Tim Ferriss | plan your supplements/drugs

<https://tim.blog/2024/02/02/no-biological-free-lunches/>  


<a id="org52a51da"></a>

## Politics


<a id="org9772863"></a>

### University faculty-activists are a perfect example of elite overproduction a la Turchin. | HN>

[Faculty group calls on Yale to make teaching 'distinct from activism' (yaledailynews.com) | HN](https://news.ycombinator.com/item?id=39443548)  


<a id="orge4b314f"></a>

### [Institutions try to preserve the problem to which they are the solution (effectiviology.com) | HN](https://news.ycombinator.com/item?id=39491863)

See CIA vs Russia.  


<a id="org4a659df"></a>

### CCP Tightens Exit Controls Amid Sharp Increase In Citizens Fleeing China | The Epoch Times

<https://www.zerohedge.com/geopolitical/ccp-tightens-exit-controls-amid-sharp-increase-citizens-fleeing-china>  

Serfs.  


<a id="org9c4c5f2"></a>

## Sitreps


<a id="orgfb9b47b"></a>

### [Global SITREP for Monday, 05 February 2024 | Pacific theater moves](https://forwardobserver.com/global-sitrep-for-monday-05-february-2024/)


<a id="org8d58e1f"></a>

### Global SITREP for Friday, 16 February 2024 | Jared Vaughn> | Iran assisting Houthis | Egypt Rafah border wall

<https://forwardobserver.com/global-sitrep-for-friday-16-february-2024/>  


<a id="org47fb2e8"></a>

### Global SITREP for Wednesday, 21 February 2024 | Jared Vaughn | Venezuela to join BRICS

<https://forwardobserver.com/global-sitrep-for-wednesday-21-february-2024/>  

-   Venezuela to join BRICS
-   Palestine peace process failure
-   China fishes with cyanide on Philippine reef
-   India vs China


<a id="orge143ae3"></a>

### Global SITREP for Thursday, 22 February 2024 | Jared Vaughn> | USCG in PH vs China | China will cyber-blitz Taiwan | Houthis nail another cargo ship

<https://forwardobserver.com/global-sitrep-for-thursday-22-february-2024/>  


<a id="org16f72bc"></a>

### Global SITREP for Friday, 23 February 2024 | Jared Vaughn> | Netanyahu aims to eliminate Palestine

<https://forwardobserver.com/global-sitrep-for-friday-23-february-2024/>  


<a id="org0dc6026"></a>

### Global SITREP for Monday, 26 February 2024 | Jared Vaughn> | China vs PH electronic warfare = casus belli | West interferes in Putin's election

<https://forwardobserver.com/global-sitrep-for-monday-26-february-2024/>  


<a id="org9025f81"></a>

### Global SITREP for Tuesday, 27 February 2024 | Jared Vaughn | PH preps for war with China | NATO troops (officially) to Ukraine?

<https://forwardobserver.com/global-sitrep-for-tuesday-27-february-2024/>  


<a id="org3f8d2f2"></a>

### Global Situation Report for Wednesday, 28 February 2024. | Jared Vaughn> | BRICS common currency | USmil recruitment woes | China vs PH goes military

<https://forwardobserver.com/global-sitrep-for-wednesday-28-february-2024/>  


<a id="org2271c3d"></a>

### [Global SITREP for Thursday, 29 February 2024 | Jared Vaughn>](https://forwardobserver.com/global-sitrep-for-thursday-29-february-2024/) | China will hit civilian satellites | NSA hacking CCP


<a id="org50e4cc1"></a>

### [Global SITREP for Friday, 01 March 2024 | Jared Vaughn](https://forwardobserver.com/global-sitrep-for-friday-01-march-2024/) | Egypt in Rafah | Israel to invade Lebanon | China, USA weaponize space


<a id="orga29644a"></a>

## Tech


<a id="org08e1877"></a>

### [Why is the mouse cursor slightly tilted and not straight? (ux.stackexchange.com) | HN](https://news.ycombinator.com/item?id=39248225) | right-handed tool


<a id="orgacdbb46"></a>

### Org-mode | Textmind competitors | Reorg

[Reorg: Re​organize your life | Github](https://github.com/legalnonsense/reorg)  

Interesting attempt at a Textmind Org-mode competitor.  Not threatening, but maybe inspiring, particularly the documentation.  


<a id="org0647862"></a>

### Woke Big Tech Cartel seeks government censorship of AI | HN>

[Google CEO calls Gemini completely unacceptable, vows to make structural changes (semafor.com) | HN](https://news.ycombinator.com/item?id=39534608)  


<a id="org30d443b"></a>

## War


<a id="org19beb56"></a>

### Myanmar’s Spring Revolution is Redefining 21st-Century Warfare | Uday | drone insurgency

<https://prestonstewart.substack.com/p/myanmars-spring-revolution-asymmetric>  

IIRC China backed the Tatmadaw.  


<a id="org5069c70"></a>

### Beware Iran’s Military-Industrial Complex: How Tehran is Changing the Nature of Asymmetric Warfare | Adam Rousselle | suicide drones and medium missiles via sanctions evasion

<https://prestonstewart.substack.com/p/beware-irans-military-industrial>  

Cheap long-range suicide drones built with sanctions-evading components, and medium missiles.  


<a id="org47589ca"></a>

### The Spy War: How the C.I.A. Secretly Helps Ukraine Fight Putin | Dnyuz> | longtime partners

<https://dnyuz.com/2024/02/25/the-spy-war-how-the-c-i-a-secretly-helps-ukraine-fight-putin/>  

Institutions perpetuate the problem they fix.  


<a id="orgc707bb4"></a>

### [American Special Forces in Taiwan for Permanent Training | Mar 2, 2024  | Martin Armstrong>](https://www.armstrongeconomics.com/world-news/geopolitical/american-special-forces-in-taiwan-for-permanent-training/)

